#include "NavBase.h"

INavBase::INavBase() 
    : bAutoNav(false),
    Waypoints {
    // [Line 1] 남단 서 -> 동
    { 1,  FVector(-35000.0f, -35000.0f, 7000.0f), 1500.0f },
    { 2,  FVector(35000.0f, -35000.0f, 7000.0f), 1500.0f },

    // [Line 2] 남중 동 -> 서
    { 3,  FVector(35000.0f, -23000.0f, 7000.0f), 1500.0f },
    { 4,  FVector(-35000.0f, -23000.0f, 7000.0f), 1500.0f },

    // [Line 3] 중남 서 -> 동
    { 5,  FVector(-35000.0f, -11000.0f, 7000.0f), 1500.0f },
    { 6,  FVector(35000.0f, -11000.0f, 7000.0f), 1500.0f },

    // [Line 4] 맵 정중앙(Center) 동 -> 서
    { 7,  FVector(35000.0f,      0.0f, 7000.0f), 1500.0f },
    { 8,  FVector(-35000.0f,      0.0f, 7000.0f), 1500.0f },

    // [Line 5] 중북 서 -> 동
    { 9,  FVector(-35000.0f,  11000.0f, 7000.0f), 1500.0f },
    { 10, FVector(35000.0f,  11000.0f, 7000.0f), 1500.0f },

    // [Line 6] 북중 동 -> 서
    { 11, FVector(35000.0f,  23000.0f, 7000.0f), 1500.0f },
    { 12, FVector(-35000.0f,  23000.0f, 7000.0f), 1500.0f },

    // [Line 7] 북단 서 -> 동
    { 13, FVector(-35000.0f,  35000.0f, 7000.0f), 1500.0f },
    { 14, FVector(35000.0f,  35000.0f, 7000.0f), 1500.0f },

    // [귀환 라인] 처음 시작 위치(1번)로 안전하게 복귀하는 우회로
    { 15, FVector(38000.0f,      0.0f, 7000.0f), 1500.0f },
    { 16, FVector(0.0f, -38000.0f, 7000.0f), 1500.0f }
    // 16번 도달 시 % 연산자에 의해 다시 1번으로 자동 순환!
}
{
    // 본문은 비워두거나 추가 초기화 로직 작성
}