#include "NavBase.h"

INavBase::INavBase() 
    : bAutoNav(false)
    , Waypoints{
            // Line 1: 서남 -> 동남
            { 1, FVector(-35000.0f, -35000.0f, 10000.0f), 1500.0f },
            { 2, FVector(35000.0f, -35000.0f, 10000.0f), 1500.0f },

            // Line 2: 동중 -> 서중
            { 3, FVector(35000.0f, -10000.0f, 10000.0f), 1500.0f },
            { 4, FVector(-35000.0f, -10000.0f, 10000.0f), 1500.0f },

            // Line 3: 서중북 -> 동중북
            { 5, FVector(-35000.0f,  15000.0f, 10000.0f), 1500.0f },
            { 6, FVector(35000.0f,  15000.0f, 10000.0f), 1500.0f },

            // Line 4: 동북 -> 서북
            { 7, FVector(35000.0f,  35000.0f, 10000.0f), 1500.0f },
            { 8, FVector(-35000.0f,  35000.0f, 10000.0f), 1500.0f }
            // 이후 모듈로(%) 연산에 의해 1번으로 복귀하여 무한 반복 순환
        }
{
    // 본문은 비워두거나 추가 초기화 로직 작성
}